basic/controllers/AdminController.php

SELECT * FROM `servicesCategory`
---
				}
		}
		else if($svc == "portalServices" || $svc == "portalServicesCategory" || $svc == "portalServicesCurrentCategory"){
			$SConnector = [
				'c' => [new PortalServices, PortalServices::find()],
				's' => [new PortalServicesCategory, PortalServicesCategory::find()]
			];

			if($svc == "portalServicesCategory"){ $svcl = $SConnector['s'][1]->all(); }