basic/controllers/ObjectsController.php

SELECT COUNT(*) FROM `experts`
SELECT DISTINCT JSON_UNQUOTE(JSON_EXTRACT(inform, `"$`.`service[*]`.`svc")) as "title"` FROM `experts`
---
    public function actionExperts()
    {
        $this->view->registerCssFile('/css/experts.css');
        $this->view->registerJsFile('/js/experts.js', ['position' => View::POS_END]);

        $basicResponse = [
            'list' => Expert::find()->select('id, created, JSON_UNQUOTE(JSON_EXTRACT(person, "$[*].titleImage")) as "titleImage", JSON_UNQUOTE(JSON_EXTRACT(person, "$[*].name")) as "name", JSON_UNQUOTE(JSON_EXTRACT(person, "$[*].specialization")) as "specialization", JSON_UNQUOTE(JSON_EXTRACT(inform, "$[*][1].slogan")) as "slogan", JSON_UNQUOTE(JSON_EXTRACT(person, "$[*].workExperience")) as "workExperience", JSON_UNQUOTE(JSON_EXTRACT(person, "$[*].regulator")) as "regulator", JSON_UNQUOTE(JSON_EXTRACT(inform, "$[*][2].isFreeAppreal")) as "isFreeAppreal", JSON_UNQUOTE(JSON_EXTRACT(inform, "$[*][0].attachments")) as "attachments", JSON_UNQUOTE(JSON_EXTRACT(person, "$[*].raiting")) as "raiting"')->orderBy('created DESC')->asArray()->all(),
            'expertsCount' => Expert::find()->count(),
        ];

        $dataLake = [
			'theme' => Expert::find()->select('JSON_UNQUOTE(JSON_EXTRACT(inform, "$.service[*].svc")) as "title"')->distinct()->all(),
			'cost' => Expert::find()->select('JSON_UNQUOTE(JSON_EXTRACT(inform, "$.amounts[*][0]")) as "cost"')->distinct()->all(),