basic/controllers/SiteController.php

SELECT COUNT(*) FROM `investments`
SELECT COUNT(*) FROM `users`
---
	public function actionIndex(){
		$this->view->registerCssFile("https://unpkg.com/swiper/swiper-bundle.min.css");
		$this->view->registerJsFile("https://unpkg.com/swiper/swiper-bundle.min.js", ['position' => View::POS_HEAD]);
		$this->view->registerCssFile("/css/inpage_codes/homepage_styles.css");
		$this->view->registerJsFile("/js/addons/slidesshow.js", ['position' => View::POS_END]);
		$this->view->registerJsFile("/js/inpage_codes/homepage_script.js", ['position' => View::POS_END]);


		$sc = [
			[ObjectsData::find()->count(), Investments::find()->count(), PortalServices::find()->count(), User::find()->count()],
			[ObjectAttribute::find()->count(), Offers::find()->count()]
		];

SELECT * FROM `servicesCategory`
---
	public function actionServices(){
		$this->view->registerCssFile("/css/services.css");
		$this->view->registerJsFile("/js/services.js", ['position' => View::POS_END]);

		$sf = [
			PortalServicesCategory::find()->all(),
			PortalServices::find()->all()
		];